Revit 2027 API
AnalysisDisplayStyle.GetColorSettings Method
 Get color settings object from the style.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public AnalysisDisplayColorSettings GetColorSettings()
Public Function GetColorSettings As AnalysisDisplayColorSettings
public:
AnalysisDisplayColorSettings^ GetColorSettings()
member GetColorSettings : unit -> AnalysisDisplayColorSettings
Return Value
AnalysisDisplayColorSettings
See Also
Reference
AnalysisDisplayStyle Class
Autodesk.Revit.DB.Analysis Namespace